#pragma once
/*
	файл c определением класса Player

	нужен для реализации коллизий игрока

	игрок представляет собой окружность, по которой распределено 4 точки, которые будут проверяться на коллизию
	и корректировать направление движения
*/

class Player {
public:
	
	//конструктор по умолчанию
	Player(double x, double y, double A, double r) {};

	//массив точек коллизий
	vector<pair<double, double>> points() {};

	//смещение вперед
	void forward() {};

	//смещение назад
	void back() {};

	//поворт налево
	void left() {};

	//поворот направо
	void right() {};

private:
	double x, y; // нынешнее положение
	double A; // нынешнее направление

	int r; // радиус круга, описывающий игрока
};
