#pragma once
#include <vector>
#include <iostream>
#include "board.h"
/*
	файл c определением класса Playfield

	представляет собой 2мерный массив, поддерживающий в себе карту расположения обьектов

	0 - пустота
	1 - стенка
	2 - допустим, предмет ?
*/

class Playfield {
public:
	
	std::vector<Board> boards; //массив всех уже созданых коробок
	
	//конструктор с заданием размеров
	// !!! ПО УМОЛЧАНИЮ ЗАПОЛНЯЕТ ГРАНИЦЫ ПОЛЯ СТЕНАМИ !!!
	Playfield(int _w, int _h, int _k); 

	//установаить в прямоугольнике с заданными параметрами заданный тип 
	//координаты включительно, в 1-индексанции
	//TO_DO на данный момент можно только добавлять стенки, но не убирать
	void set_rectangle(int _x1, int _y1, int _x2, int _y2, int tp);

	//выводит игровое поле в консоль
	void print();

private:
	int h; //высота
	int w; //ширина
	int k; //длина стороны клетки

	std::vector<std::vector<int>> field; //поле в 2-мерном виде
};
